raohassandev/esp32_firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# Shared by httpd, the Modbus TCP client, DHCP and DNS. httpd reserves 3 on top
# of its max_open_sockets, so 12 left nothing spare once the web server was
# sized for a browser's keep-alive connections.
CONFIG_LWIP_MAX_SOCKETS=16

# The DevKitC-1 N16R8 carries 8 MB of octal PSRAM that was going unused while
# minimum free internal heap fell to 40 kB and internal fragmentation reached
# 29%. That shortage is what makes large JSON responses fail intermittently.
# Allocations above the threshold go to PSRAM; small and ISR-safe allocations
# stay internal.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=256
# The live interface is one long-lived connection per browser, not seven polled
# endpoints. Measured on the board: one tab holding the plant overview kept TEN
# established connections -- the whole of max_open_sockets -- because a browser
# opens its keep-alive pool and holds it whatever it is asked to carry. Two tabs
# saturated the controller and a third would have been refused. Reducing the
# number of endpoints did not help: a page making eleven requests in twenty-one
# seconds still held ten sockets. Only a single connection does.
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_PVDG_DEFAULT_ZLAN_HOST="192.168.100.200"

# Scheduler granularity. The default 100 Hz gives a 10 ms tick, which quantises
# every vTaskDelay and puts a 10 ms floor under the control period and under any
# poll delay an engineer configures. Acquisition is meant to run at the speed the
# device answers (tens of milliseconds), so a 10 ms quantum is the same order as
# the work being scheduled. 1 kHz gives a 1 ms tick at the cost of more frequent
# tick interrupts.
CONFIG_FREERTOS_HZ=1000

# The controller is relocated between sites, so it must be findable by name
# rather than by whatever address the local DHCP server happened to hand out.
# The responder is bound to BOTH predefined interfaces, so http://<host>.local
# resolves on the site network and on the controller's own recovery AP.
CONFIG_MDNS_PREDEF_NETIF_STA=y
CONFIG_MDNS_PREDEF_NETIF_AP=y
# There is no Ethernet on this board, and only one _http._tcp record is ever
# published. Trimming the interface and service tables from the library defaults
# of 3 and 10 returns static RAM on a part whose minimum free internal heap has
# previously fallen to ~40 kB. MDNS_MAX_INTERFACES must not drop below the
# number of predefined interfaces still enabled - the library enforces that with
# a #warning, which this build treats as an error.
CONFIG_MDNS_PREDEF_NETIF_ETH=n
CONFIG_MDNS_MAX_INTERFACES=2
CONFIG_MDNS_MAX_SERVICES=2
